[
    {
        "id": 1,
        "title": ["Music Application"],
        "slug": "music-application",
        "framework": "React Native",
        "hoverColor": "#9985c5",
        "summary": "A music player app built with React Native. It lets you play songs, pause, and manage playlists.",
        "columns": 2,
        "image": "/images/projects/music/music-app-1.png",
        "images": ["/images/projects/music/music-app-1.png", "/images/projects/music/music-app-2.png"],
        "description": "This app is made with React Native to learn mobile app development. It includes basic controls like play, pause, and stop. Users can adjust the volume, shuffle songs, and repeat tracks. The main challenge was setting up all the tools correctly and fixing issues during development. Creating the APK file for Android took time because I had to learn new steps. This project taught me how to solve problems and manage app features better."
    },
    {
        "id": 2,
        "title": ["Recreated Twitter partly using MongoDB"],
        "slug": "recreated-twitter-partly-using-mongodb",
        "framework": "MongoDB, NodeJS",
        "hoverColor": "#1b8ca6",
        "summary": "A simple Twitter-like app built with MongoDB and NodeJS. Users can post and view tweets.",
        "columns": 1,
        "image": "/images/projects/twitter/twitter-1.png",
        "images": ["/images/projects/twitter/twitter-1.png", "/images/projects/twitter/twitter-2.png", "/images/projects/twitter/twitter-3.png"],
        "link": "https://twittah.onrender.com",
        "description": "This project copies basic Twitter features using MongoDB and NodeJS. At first, I used JSON for data storage, but I switched to MongoDB after feedback. The app shows tweets and stores them in the database. Challenges included learning how to use a database and making the design simple and easy to use. This project helped me understand how to connect a database to a website and improve my backend development skills."
    },
    {
        "id": 3,
        "title": ["AMW Veranda"],
        "slug": "amw-veranda",
        "framework": "PHP, Bootstrap",
        "hoverColor": "#84fee2",
        "summary": "A client website made for a veranda company. It includes a contact form and language options.",
        "columns": 1,
        "image": "/images/projects/amw/amw-1.png",
        "images": ["/images/projects/amw/amw-1.png", "/images/projects/amw/amw-2.png"],
        "link": "http://amwveranda.nl",
        "description": "I created this website for a company that sells verandas. The site includes a contact form where users can send messages and switch between languages. Hosting the site on GoDaddy was challenging because I had to figure out the deployment process. This project helped me learn more about building websites for real clients and solving hosting problems."
    },
    {
        "id": 4,
        "title": ["Note App with EJS"],
        "slug": "note-app-with-ejs",
        "framework": "EJS, NodeJS",
        "hoverColor": "#fcfe8f",
        "summary": "A note app built with EJS and NodeJS. It includes text recognition and note management features.",
        "columns": 1,
        "image": "/images/projects/ejs/ejs-2.png",
        "images": ["/images/projects/ejs/ejs-1.png", "/images/projects/ejs/ejs-2.png"],
        "link": "https://duocase.onrender.com",
        "description": "This app allows users to take notes, upload images, and recognize text in pictures using Tesseract.js. The app was built with EJS and NodeJS. One challenge was managing how files are stored and displayed on the website. This project taught me how to use APIs and handle data between the frontend and backend."
    },
    {
        "id": 5,
        "title": ["First version of my portfolio"],
        "slug": "first-version-of-my-portfolio",
        "framework": "VueJS",
        "hoverColor": "#0166ff",
        "summary": "The first version of my portfolio website. It showcases my projects and skills.",
        "columns": 1,
        "image": "/images/projects/portfolio/portfolio-1.png",
        "images": ["/images/projects/portfolio/portfolio-1.png", "/images/projects/portfolio/portfolio-2.png", "/images/projects/portfolio/portfolio-3.png"],
        "link": "https://firstportfolio-r.vercel.app",
        "description": "This was the first version of my portfolio. I used VueJS to build a responsive website that showed my work and skills. A challenge was making sure the website worked well on different browsers and devices. This project helped me understand how to create a portfolio for potential clients or employers."
    }
  ]
  
